<script setup>
defineProps({
    name: {
        type: String,
        required: true, // Название иконки, например "icon-circle"
    },
    size: {
        type: [String, Number],
        default: 24, // Размер иконки (по умолчанию 24x24)
    },
})
</script>

<template>
    <div>
        <svg class="icon" xmlns="http://www.w3.org/2000/svg" :width="size" :height="size" loading="lazy">
            <use :href="`#${name}`" />
        </svg>

        <svg xmlns="http://www.w3.org/2000/svg" style="display: none">
            <symbol id="icon-education" viewBox="0 0 22 18">
                <path fill="#fff" d="M3.333 10.213v2.81c0 .73.4 1.41 1.04 1.76l5 2.73c.6.33 1.32.33 1.92 0l5-2.73c.64-.35 1.04-1.03 1.04-1.76v-2.81l-6.04 3.3c-.6.33-1.32.33-1.92 0l-6.04-3.3Zm6.04-9.66-8.43 4.6c-.69.38-.69 1.38 0 1.76l8.43 4.6c.6.33 1.32.33 1.92 0l8.04-4.39v5.91c0 .55.45 1 1 1s1-.45 1-1v-6.41c0-.37-.2-.7-.52-.88l-9.52-5.19a2.04 2.04 0 0 0-1.92 0Z" />
            </symbol>
        </svg>

        <svg xmlns="http://www.w3.org/2000/svg" style="display: none">
            <symbol id="icon-star" viewBox="0 0 20 19">
                <path fill="#fff" fill-rule="evenodd" d="M8.101 1.399c.563-1.865 3.235-1.865 3.798 0l1.35 4.47 4.718-.112c1.968-.046 2.793 2.466 1.173 3.571l-3.883 2.651 1.566 4.402c.653 1.836-1.509 3.388-3.073 2.207L10 15.755l-3.75 2.833c-1.564 1.181-3.726-.371-3.072-2.207l1.565-4.402L.86 9.33C-.76 8.222.065 5.71 2.033 5.756l4.718.112 1.35-4.47Zm1.899.56L8.65 6.43a1.98 1.98 0 0 1-1.946 1.398l-4.718-.112 3.883 2.651a1.947 1.947 0 0 1 .744 2.262l-1.566 4.402 3.75-2.832a2 2 0 0 1 2.406 0l3.75 2.832-1.566-4.402a1.947 1.947 0 0 1 .744-2.262l3.883-2.65-4.717.111A1.98 1.98 0 0 1 11.35 6.43L10 1.96Z" clip-rule="evenodd" />
            </symbol>
        </svg>

        <svg xmlns="http://www.w3.org/2000/svg" style="display: none">
            <symbol id="icon-wavy-check" viewBox="0 0 20 20">
                <path fill="#fff" d="M13.937 8.668a.818.818 0 0 0 0-1.222.992.992 0 0 0-1.323 0l-3.55 3.276-1.678-1.548a.992.992 0 0 0-1.323 0 .818.818 0 0 0 0 1.221l2.34 2.16a.992.992 0 0 0 1.323 0l4.21-3.887Z" />
                <path fill="#fff" fill-rule="evenodd" d="M11.214.447a1.872 1.872 0 0 0-2.428 0L6.76 2.175l-2.656.212c-.916.073-1.643.8-1.716 1.716L2.175 6.76.447 8.786a1.872 1.872 0 0 0 0 2.428l1.728 2.027.212 2.655c.073.917.8 1.644 1.716 1.717l2.656.212 2.027 1.728c.7.596 1.728.596 2.428 0l2.027-1.728 2.655-.212a1.872 1.872 0 0 0 1.717-1.716l.212-2.656 1.728-2.027c.596-.7.596-1.728 0-2.428L17.825 6.76l-.212-2.656a1.872 1.872 0 0 0-1.716-1.716l-2.656-.212L11.214.447ZM7.973 3.6 10 1.872l2.027 1.727c.3.256.673.41 1.065.441l2.656.212.212 2.656c.03.392.185.765.44 1.065L18.129 10l-1.727 2.027c-.256.3-.41.673-.441 1.065l-.212 2.656-2.656.212a1.872 1.872 0 0 0-1.065.44L10 18.129l-2.027-1.727c-.3-.256-.673-.41-1.065-.441l-2.656-.212-.212-2.656a1.871 1.871 0 0 0-.44-1.065L1.871 10l1.727-2.027c.256-.3.41-.673.441-1.065l.212-2.656 2.656-.212a1.872 1.872 0 0 0 1.065-.44Z" clip-rule="evenodd" />
            </symbol>
        </svg>
    </div>
</template>

<style lang="scss" scoped>
.icon {
    display: flex;
    align-items: center;
    justify-content: center;
    overflow: hidden;

    fill: currentColor; /* Цвет через currentColor */
    border: none;
}

// .icon-burger1 {
//     color: darkcyan;
// }
</style>
